#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/OmniRexTechnology/AWSTerraform/runs/run-axsUDwCjLLCyCJ48

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
aws_route53_zone.primary: Refreshing state... [id=Z07120232A5HV81ZZ1RFB]
aws_route53_zone.primary: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_zone.primary will be destroyed
  # (because aws_route53_zone.primary is not in configuration)
  - resource "aws_route53_zone" "primary" {
      - arn                 = "arn:aws:route53:::hostedzone/Z07120232A5HV81ZZ1RFB" -> null
      - comment             = "Managed by Terraform" -> null
      - force_destroy       = false -> null
      - id                  = "Z07120232A5HV81ZZ1RFB" -> null
      - name                = "omnirextech.com" -> null
      - name_servers        = [
          - "ns-1533.awsdns-63.org",
          - "ns-2043.awsdns-63.co.uk",
          - "ns-435.awsdns-54.com",
          - "ns-628.awsdns-14.net",
        ] -> null
      - primary_name_server = "ns-435.awsdns-54.com" -> null
      - tags                = {} -> null
      - tags_all            = {} -> null
      - zone_id             = "Z07120232A5HV81ZZ1RFB" -> null
    }

  # module.zones.aws_route53_zone.this["omnirex.com"] will be created
  + resource "aws_route53_zone" "this" {
      + arn                 = (known after apply)
      + comment             = "omnirex.com"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "omnirex.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all            = {
          + "ManagedBy" = "Terraform"
        }
      + zone_id             = (known after apply)
    }

  # module.zones.aws_route53_zone.this["terraform-omnirex.com"] will be created
  + resource "aws_route53_zone" "this" {
      + arn                 = (known after apply)
      + comment             = "Omnirex main public zone file."
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "terraform-omnirex.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "ManagedBy" = "Terraform"
          + "env"       = "production"
        }
      + tags_all            = {
          + "ManagedBy" = "Terraform"
          + "env"       = "production"
        }
      + zone_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

</details>

*Pushed by: @cmacmurray, Action: `pull_request`*